In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('/home/data/dataset/Panjiva/ciq/ciqcompany.csv.gz')
df.shape
df.head(3)

/tmp/ipykernel_139698/3041450993.py:1: DtypeWarning: Columns (2,5,6,7,9,10,11,12,16,17) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('/home/data/dataset/Panjiva/ciq/ciqcompany.csv.gz')

(17497523, 23)

,companyid,companyname,city,companystatustypeid,companytypeid,officefaxvalue,officephonevalue,otherphonevalue,simpleindustryid,streetaddress,streetaddress2,streetaddress3,streetaddress4,yearfounded,monthfounded,dayfounded,zipcode,webpage,reportingtemplatetypeid,countryid,stateid,incorporationcountryid,incorporationstateid
0,18493,DC Venture Partners,Atlanta,5,2,NaN,770-612-9190,NaN,50.0,1103 Riverbend Club Drive,NaN,NaN,NaN,1998.0,NaN,NaN,30339-2811,NaN,1.0,213.0,13.0,NaN,NaN
1,18495,13i Capital Corporation,Oak Brook,1,2,800-849-4183,630-620-2255,NaN,50.0,2021 Midwest Road,Suite 200,NaN,NaN,1993.0,NaN,NaN,60523,www.13icapital.com,1.0,213.0,17.0,NaN,NaN
2,18499,21 International Holdings Inc.,NaN,1,2,NaN,NaN,NaN,50.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,213.0,NaN,NaN,NaN

In [7]:
cid_cname = df[['companyid', 'companyname']].drop_duplicates()
cid_cname.shape
cid_cname.head(3)

(17497523, 2)

   companyid                     companyname
0      18493             DC Venture Partners
1      18495         13i Capital Corporation
2      18499  21 International Holdings Inc.

In [8]:
sec = pd.read_csv('/home/data/dataset/Panjiva/ciq/ciqsecurity.csv.gz')
sec.shape
sec.head(3)

(11446247, 7)

,securityid,companyid,securityname,securitystartdate,securityenddate,securitysubtypeid,primaryflag
0,2585870,3102567,Old Common Shares,1986-12-30 00:00:00,1996-07-12 00:00:00,1,0
1,2585872,3102567,Class A Multiple Voting Shares,2000-10-02 00:00:00,2005-10-17 00:00:00,1,0
2,2585874,3102567,Class B Subordinate Voting Shares,2000-10-02 00:00:00,2005-10-17 00:00:00,1,1

In [9]:
cf = pd.read_csv('/home/data/dataset/Panjiva/ciq/cross_reference.csv')
cf.shape
cf.head(3)

(14584192, 9)

,identifierid,companyid,identifiervalue,identifiertypeid,startdate,enddate,activeflag,primaryflag,filedate
0,3062683,6488894,36238443,21001,NaN,NaN,1,0,2018-05-29 00:00:00.000
1,911098,6488894,36255683,21001,NaN,NaN,1,0,2018-05-29 00:00:00.000
2,994408,6488894,37046565,21001,NaN,NaN,1,0,2018-05-29 00:00:00.000

In [10]:
ti = pd.read_csv('/home/data/dataset/Panjiva/ciq/ciqtradingitem.csv.gz')
ti.shape
ti.head(3)

(12243620, 7)

,tradingitemid,securityid,tickersymbol,exchangeid,currencyid,tradingitemstatusid,primaryflag
0,2585869,2585868,ANAF.F,104.0,160.0,4.0,1
1,2585871,2585870,NaN,14.0,27.0,4.0,1
2,2585873,2585872,AEF.MVA,18.0,27.0,5.0,1

In [11]:
cd = pd.read_csv('/home/data/dataset/Panjiva/ciq/ciqcompanydata.csv.gz')
cd.shape
cd.head(3)

(734023, 3)

   companyid  companydatatypeid  datavalue
0      25046                 35   459.0000
1      25048                 35  2432.0000
2      25057                 35  1550.0000

In [13]:
tk = pd.read_parquet('../isin/ciq_company_id-ticker.pq')
tk.shape
tk.head(3)

(4087014, 4)

   ciq_company_id   ticker      source     update
0           18507  1026283  Capital IQ 2022-06-18
1           18507    MMINV  Capital IQ 2022-06-18
2           18507      TW8  Capital IQ 2022-06-18

In [17]:
tk.sample(3)

         ciq_company_id     ticker      source     update
3926738       206864277     688318  Capital IQ 2022-06-18
1478669         4882369       56CG  Capital IQ 2022-06-18
4036158       213689928  186470273  Capital IQ 2022-06-18

In [14]:
cf.loc[cf['identifierid'] == 18507]

,identifierid,companyid,identifiervalue,identifiertypeid,startdate,enddate,activeflag,primaryflag,filedate
9921649,18507,234506355,28289301,21001,NaN,NaN,1,0,2020-10-21 00:00:00.000

In [18]:
cid_cname.loc[cid_cname['companyid'] == 206864277]

          companyid                                  companyname
16914103  206864277  Shenzhen Fortune Trend technology Co., Ltd.

: